Revit 2027 API
BasicFileInfo.LanguageWhenSaved Property
 Return the language active for the last save
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LanguageType LanguageWhenSaved { get; }
Public ReadOnly Property LanguageWhenSaved As LanguageType
	Get
public:
property LanguageType LanguageWhenSaved {
	LanguageType get ();
}
member LanguageWhenSaved : LanguageType with get
Property Value
LanguageType
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace